Repository: Buzztrax/buzztrax
Catalog: po/*.po
Languages: pt_br, sr

source: Fully integrated music composer.
pt_br: Compositor de música completamente integrado.
sr: Потпуно обједињен музички композитор.

source: Buzztrax is a music composer similar to tracker applications. It is roughly modelled after the windows only, closed source application called Buzz.
pt_br: Buzztrax é um compositor de música similar a aplicativos tracker. Ele é modelado para ser similar ao aplicativo Buzz, para Windows apenas e de código fechado.
sr: Зујавко је музички композитор сличан „tracker“ програмима. Грубо је оцртан према Базу, програму затвореног кода који је радио само на виндоузу.

source: Print the buzztrax core version
pt_br: Exibe a versão central do buzztrax
sr: Исписује кључно издање зујавка

source: Buzztrax core options
pt_br: Opções centrais do buzztrax
sr: Кључне опције зујавка

source: Show buzztrax core options
pt_br: Mostra as opções centrais do buzztrax
sr: Приказује кључне опције зујавка

source: normal
sr: обично

source: break
pt_br: quebra
sr: прекини

source: mute
pt_br: silenciar
sr: утишај

source: solo
sr: соло

source: bypass
pt_br: repasse
sr: премости

source: Filename must not be empty.
pt_br: O nome de arquivo não pode estar vazio.
sr: Назив датотеке не сме бити празан.

source: No io-module for filename '%s'.
pt_br: Nenhum módulo de e/s para o nome de arquivo "%s".
sr: Нема уи-модула за датотеку „%s“.

source: Media-type must not be empty.
pt_br: Tipo de mídia não pode estar vazio.
sr: Врста медија не сме бити празна.

source: No io-module for media-type '%s'.
pt_br: Nenhum módulo de e/s para o tipo de mídia "%s".
sr: Нема уи-модула за врсту медија „%s“.

source: Loading file '%s'
pt_br: Carregando o arquivo "%s"
sr: Учитавам датотеку „%s“

source: Saving file '%s'
pt_br: Salvando o arquivo "%s"
sr: Чувам датотеку „%s“

source: Failed to create memory input.
pt_br: Falha ao criar entrada de memória.
sr: Нисам успео да направим улаз меморије.

source: Is not a XML/Buzztrax document.
pt_br: Não é um documento XML/Buzztrax.
sr: Није ИксМЛ/зујавков документ.

source: Is not a wellformed XML document.
pt_br: Não é um documento XML bem formado.
sr: Није добро обликован ИксМЛ документ.

source: XML document is empty.
pt_br: Documento XML está vazio.
sr: ИксМЛ документ је празан.

source: Wrong XML document root.
pt_br: Raiz incorreta de documento XML.
sr: Погрешан корен ИксМЛ документа.

source: untitled song
pt_br: Música sem título
sr: песма без наслова

source: Buzztrax Music Editor
pt_br: Editor de Música Buzztrax
sr: Зујавко музички уредник

source: Error reading a buzz file section.
pt_br: Erro ao ler uma seção de arquivo buzz.
sr: Грешка читања одељка датотеке зујавка.

source: Is not a buzz file.
pt_br: Não é um arquivo buzz.
sr: Није бузова датотека.

source: Print the buzztrax interaction controller version
pt_br: Exibe a versão do controlador de interação do buzztrax
sr: Исписује издање контролера интеракције зујавка

source: Buzztrax interaction controller options
pt_br: Opções do controlador de interação do buzztrax
sr: Опције контролера интеракције зујавка

source: Show buzztrax interaction controller options
pt_br: Mostra as opções do controlador de interação do buzztrax
sr: Приказује опције контролера интеракције зујавка

source: Print application version
pt_br: Emite a versão do aplicativo
sr: Исписује издање програма

source: Be quiet
pt_br: Modo silencioso
sr: Бива нечујан

source: Command name
pt_br: Nome do comando
sr: Назив наредбе

source: Input file name
pt_br: Nome do arquivo de entrada
sr: Назив улазне датотеке

source: <songfile>
pt_br: <arquivo-música>
sr: <датотека_песме>

source: Output file name
pt_br: Nome do arquivo de saída
sr: Назив излазне датотеке

source: buzztrax-cmd options
pt_br: Opções do buzztrax-cmd
sr: Опције „buzztrax-cmd“

source: Show buzztrax-cmd options
pt_br: Mostra opções do buzztrax-cmd
sr: Приказује опције „buzztrax-cmd“

source: translator-credits
pt_br: Rafael Fontenelle <rffontenelle@gmail.com>
sr: Мирослав Николић <mirosavnikoic@rocketmailcom>

source: Copyright © 2003-%d Buzztrax developer team
pt_br: Copyright © 2003-%d Equipe de desenvolvedores do Buzztrax
sr: Ауторска права © 2003-%d Развојна екипа Зујавка

source: Music production environment
pt_br: Ambiente de produção musical
sr: Музичко производно окружење

source: This package is free software; you can redistribute it and/or modify it under the terms of the GNU Library General Public License as published by the Free Software Foundation; either version 2.1 of the License, or (at your option) any later version. This package is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public License for more details. You should have received a copy of the GNU Library General Public License along with this package; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
pt_br: Este pacote é um software livre; você pode redistribuí-lo e/ou modificá-lo sob os termos da Licença Pública Geral de Biblioteca GNU como foi publicado pela Free Software Foundation; na versão 2.1 da licença ou, se preferir, qualquer outra posterior. Este pacote é distribuído na esperança de que ele será útil, mas SEM QUALQUER GARANTIA; sem mesmo a garantia implícita de MERCANTILIDADE ou ADEQUAÇÃO PARA UM PROPÓSITO PARTICULAR. Veja a Licença Pública Geral de Biblioteca GNU para mais detalhes. Você deveria receber uma cópia da Licença Pública Geral de Biblioteca GNU junto com este pacote. Se não recebeu, escreva para a Free Software Foundation, Inc., no endereço: 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
sr: Овај програм је слободан софтвер; можете га расподељивати и/или мењати под условима Гнуове библиотечке опште јавне лиценце коју је објавила Задужбина слободног софтвера; издања 2.1 лиценце или (по вашем избору) било којег новијег издања. Овај програм се расподељује у нади да ће бити користан, али БЕЗ ИКАКВЕ ГАРАНЦИЈЕ; чак и без примењене гаранције ТРЖИШНЕ ВРЕДНОСТИ или ПРИЛАГОЂЕНОСТИ ОДРЕЂЕНОЈ НАМЕНИ. Погледајте Гнуову Библиотечку општу јавну лиценцу за више детаља. Требали сте да примите примерак Гнуове Библиотечке опште јавне лиценце уз овај програм. Ако нисте, пишите Задужбини слободног софтвера на адресу: „Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA“.

source: Just a few month since the previous release, this update mostly focuses on getting rid of deprecated APIs. Besides that it also come with a new synthesizer plugin called 'ebeats'. As the name suggests it is good at making percussion sounds. Together with that the library providing the dsp components got overhauled.
pt_br: Apenas alguns meses desde o lançamento anterior, esta atualização possui foco principal em se livrar de APIs obsoletas. Além disso, ela também vem com um novo plug-in sintetizador chamado "ebeats". Como o nome sugere, ele é bom em fazer sons de percussão. Junto com ele, a biblioteca fornecendo os componentes dsp foi revisada.
sr: Само неколико месеци од претходног издања, ово освежење се углавном фокусира на ослобађање од застарелих АПИ-ја. Поред тога такође долазе са новим прикључком синтисајзера под називом „“. Као што име сугерише добар је за добијање звукова удараљки. Заједно са тим библиотека обезбеђује да дсп компоненте добију ремонт.

source: buzztrax-edit options
pt_br: Opções do buzztrax-edit
sr: Опције „buzztrax-edit“

source: Show buzztrax-edit options
pt_br: Mostra opções do buzztrax-edit
sr: Приказује опције уређивања зујавка

source: Edit buzztrax song files
pt_br: Edite arquivos de música do buzztrax
sr: Уређујте зујавкове датотеке песама

source: unsaved song
pt_br: música não salva
sr: несачувана песма

source: Recovery finished
pt_br: Recuperação finalizada
sr: Опоравак је завршен

source: The selected song has been recovered successful.
pt_br: A música selecionada foi recuperada com sucesso.
sr: Изабрана песма је успешно опорављена.

source: Please check the song and save it if everything is alright.
pt_br: Por favor, verifique a música e salve-a, se tudo estiver correto.
sr: Проверите песму и сачувајте је ако је све у реду.

source: Recovery failed
pt_br: Recuperação falhou
sr: Опоравак није успео

source: Sorry, the selected song could not be fully recovered.
pt_br: Desculpe, a música não pôde ser completamente recuperada.
sr: Извините, изабрана песма не може у потпуности бити опорављена.

source: Please check the song and save it if still looks good.
pt_br: Por favor, verifique a música e salve-a, se ainda estiver boa.
sr: Проверите песму и сачувајте је ако још увек изгледа добро.

source: Unsaved song recovery
pt_br: Recuperação de música não salva
sr: Опоравак несачуване песме

source: _Close
pt_br: _Fechar
sr: _Затвори

source: Unsaved songs found
pt_br: Músicas não salvas encontradas
sr: Нађох несачуване песме

source: Select them one by one and choose 'recover' or 'delete'.
pt_br: Selecione-as uma por vez e escolha "recuperar" ou "excluir".
sr: Изаберите их једну по једну и изаберите „опоравак“ или „брисање“.

source: Song file
pt_br: Arquivo de música
sr: Датотека песме

source: Last changed
pt_br: Última modificação
sr: Последња измена

source: Recover
pt_br: Recuperar
sr: Опорави

source: Delete
pt_br: Excluir
sr: Обриши

source: -> You will not see any level-meters.
pt_br: -> Você não verá quaisquer medidores de níveis.
sr: → Нећете видети никакав мерач нивоа.

source: -> You will not see the frequency spectrum in the analyzer window.
pt_br: -> Você não verá o espectro de frequência na janela de análise.
sr: → Нећете видети спектар учесталости у прозору анализатора.

source: -> Sample playback previews from the wavetable page will not work.
pt_br: -> Pré-visualização da reprodução de amostra a partir da página de tabela de ondas não funcionará.
sr: → Прегледи репродуковања узорка са странице таласне табеле неће радити.

source: Can't load song '%s'.
pt_br: Não foi possível carregar a música "%s".
sr: Не могу да учитам песму „%s“.

source: Can't load song
pt_br: Não foi possível carregar a música
sr: Не могу да учитам песму

source: Learn…
pt_br: Aprender…
sr: Учим…

source: Bind controller
pt_br: Associar controlador
sr: Свежи контролер

source: Unbind controller
pt_br: Desassociar controlador
sr: Развежи контролер

source: Unbind all controllers
pt_br: Desassociar todos os controladores
sr: Развежи све контролере

source: by %s %s
pt_br: por %s %s
sr: од %s %s

source: About…
pt_br: Sobre…
sr: Подаци…

source: Mute
pt_br: Silenciar
sr: Утишај

source: Solo
sr: Соло

source: Bypass
pt_br: Repasse
sr: Премости

source: _Properties
pt_br: _Propriedades
sr: _Својства

source: _Preferences
pt_br: _Preferências
sr: _Поставке

source: Rename…
pt_br: Renomear…
sr: Преименуј…

source: _Delete
pt_br: E_xcluir
sr: _Обриши

source: Connect machines
pt_br: Conectar máquinas
sr: Повежи машине

source: Signal Analysis…
pt_br: Análise de sinal…
sr: Анализа сигнала…

source: Play with
pt_br: Reproduzir com
sr: Пусти програмом

source: _Help
pt_br: A_juda
sr: По_моћ

source: _About
pt_br: _Sobre
sr: _Инфо

source: Generators
pt_br: Geradores
sr: Генератори

source: Effects
pt_br: Efeitos
sr: Дејства

source: preset name and comment
pt_br: predefinir nome e comentário
sr: назив и напомена подешености

source: _OK
sr: У _реду

source: _Cancel
pt_br: _Cancelar
sr: _Откажи

source: name
pt_br: nome
sr: назив

source: comment
pt_br: comentário
sr: напомена

source: %s preferences
pt_br: Preferências de %s
sr: Поставке %s-а

source: Reset parameter
pt_br: Redefinir parâmetro
sr: Врати параметар

source: Reset all parameters
pt_br: Redefinir todos parâmetros
sr: Врати све параметре

source: Copy parameter
pt_br: Copiar parâmetro
sr: Умножи параметар

source: Paste
pt_br: Colar
sr: Убаци

source: Copy group
pt_br: Copiar grupo
sr: Умножи групу

source: global properties
pt_br: propriedades globais
sr: општа својства

source: voice %lu properties
pt_br: propriedades de voz %lu
sr: својства гласа %lu

source: %s wire properties
pt_br: propriedades da linha %s
sr: својства жице „%s“

source: _Add
pt_br: _Adicionar
sr: _Додај

source: Add new preset
pt_br: Adiciona nova predefinição
sr: Додајте нову подешеност

source: _Remove
pt_br: _Remover
sr: У_клони

source: Remove preset
pt_br: Remove predefinição
sr: Уклоните подешеност

source: _Edit
pt_br: _Editar
sr: У_реди

source: Edit preset name and comment
pt_br: Edita nome e comentário da predefinição
sr: Уредите назив и напомену подешености

source: Preset
pt_br: Predefinição
sr: Подешеност

source: machine properties
pt_br: propriedades da máquina
sr: својства машине

source: Info about this machine
pt_br: Info sobre esta máquina
sr: Подаци о овој машини

source: Help for this machine
pt_br: Ajuda para esta máquina
sr: Помоћ за ову машину

source: _New
pt_br: _Nova
sr: _Ново

source: Randomize parameters
pt_br: Aleatoriza parâmetros
sr: Насумичи својства

source: _Undo
pt_br: _Desfazer
sr: _Поништи

source: Reset parameters to defaults
pt_br: Redefine parâmetros para o padrão
sr: Вратите параметре на подразумеване

source: Presets
pt_br: Predefinições
sr: Подешености

source: Show/Hide preset pane
pt_br: Mostra/Oculta o painel de predefinições
sr: Прикажи/сакриј окно подешености

source: %s properties
pt_br: Propriedades de %s
sr: својства за „%s“

source: %s name
pt_br: Nome de %s
sr: назив „%s“

source: Load new song?
pt_br: Carregar nova música?
sr: Да учитам нову песму?

source: Recover a song?
pt_br: Recuperar uma música?
sr: Да опоравим песму?

source: _File
pt_br: _Arquivo
sr: _Датотека

source: _Open
pt_br: A_brir
sr: _Отвори

source: _Recently used
pt_br: Usadas _recentemente
sr: _Недавно коришћена

source: _Save
pt_br: _Salvar
sr: _Сачувај

source: Save _As
pt_br: Salvar _como
sr: Сачувај _као

source: Recover unsaved songs
pt_br: Recuperar músicas não salvas
sr: Опорави несачуване песме

source: _Record
pt_br: _Gravar
sr: _Снимај

source: _Quit
pt_br: Sa_ir
sr: _Изађи

source: _Redo
pt_br: _Refazer
sr: _Понови

source: Cu_t
pt_br: Recor_tar
sr: _Исеци

source: _Copy
pt_br: _Copiar
sr: _Умножи

source: _Paste
pt_br: C_olar
sr: У_баци

source: _View
pt_br: _Ver
sr: _Преглед

source: Toolbar
pt_br: Barra de ferramentas
sr: Трака алата

source: Statusbar
pt_br: Barra de status
sr: Трака стања

source: Tabs
pt_br: Abas
sr: Табулатори

source: Fullscreen
pt_br: Tela cheia
sr: Цео екран

source: Go to machine view
pt_br: Ir para visão de máquina
sr: Иди на преглед машине

source: Go to pattern view
pt_br: Ir para visão de padrão
sr: Иди на преглед шаблона

source: Go to sequence view
pt_br: Ir para a visão de sequência
sr: Иди на преглед низа

source: Go to wave table view
pt_br: Ir para a visão de tabela de onda
sr: Иди на преглед таласне табеле

source: Go to song information
pt_br: Ir para informação da música
sr: Иди на податке о песми

source: _Playback
pt_br: _Reprodução
sr: _Репродукуј

source: _Play
pt_br: _Reproduzir
sr: _Пусти

source: Play from cursor
pt_br: Reproduzir a partir do cursor
sr: Пусти од курзора

source: _Stop
pt_br: _Parar
sr: _Заустави

source: Help
pt_br: Ajuda
sr: Помоћ

source: Tip of the day
pt_br: Dica do dia
sr: Савет дана

source: Join IRC discussion
pt_br: Entrar uma discussão do IRC
sr: Приступите ИРЦ расправи

source: Report a problem
pt_br: Relatar um problema
sr: Пријавите проблем

source: song meta data
pt_br: metadados da música
sr: мета подаци песме

source: genre
pt_br: gênero
sr: жанр

source: author
pt_br: autor
sr: аутор

source: created
pt_br: criado
sr: снимљена

source: beats per minute
pt_br: batidas por minuto
sr: тактова у минуту

source: beats
pt_br: batidas
sr: тактова

source: ticks per beat
pt_br: tiques por batida
sr: откуцаја у такту

source: last saved
pt_br: salvo pela última vez
sr: последње чување

source: free text info
pt_br: info de texto livre
sr: слободни подаци текста

source: Add machine
pt_br: Adicionar a máquina
sr: Додај машину

source: Unmute all machines
pt_br: Desativar mudo em todas as máquinas
sr: Поништи утишање свих машина

source: Off
pt_br: Desligado
sr: Искљ.

source: Low
pt_br: Baixo
sr: Ниско

source: Medium
pt_br: Médio
sr: Средње

source: High
pt_br: Alto
sr: Високо

source: Best _Fit
pt_br: _Melhor ajuste
sr: Најбоље _уклапање

source: Zoom in/out so that everything is visible
pt_br: Amplia/Reduz, de forma que tudo esteja visível
sr: Увећај/умањи тако да се све види

source: Zoom _In
pt_br: Ampl_iar
sr: У_већај

source: Zoom in for more details
pt_br: Amplia para mais detalhes
sr: Увећајте за више детаља

source: Zoom _Out
pt_br: _Reduzir
sr: У_мањи

source: Zoom out for better overview
pt_br: Reduz para melhor visão geral
sr: Умањи за бољи преглед

source: Grid
pt_br: Grade
sr: Мрежа

source: Show background grid
pt_br: Mostra a grade no plano de fundo
sr: Прикажите мрежу позадине

source: Machine view menu
pt_br: Menu de visão de máquina
sr: Изборник прегледа машине

source: Menu actions for machine view below
pt_br: Ações de menu para a visão de máquina abaixo
sr: Радње изборника за преглед машине испод

source: Add new machines from right click context menu. Connect machines with shift+drag from source to target.
pt_br: Adicione novas máquinas a partir do menu de contexto (com botão direito do mouse). Conecte máquinas com shift+arrastar da origem para o destino.
sr: Додајте нове машине из приручног изборника десног клика. Повежите машине са помаком+превлачењем од извора до циља.

source: Add new patterns from right click context menu.
pt_br: Adicione novos padrões a partir do menu de contexto (com botão direito do mouse).
sr: Додајте нове шаблоне из приручног изборника десног клика.

source: Globals
pt_br: Globais
sr: Општости

source: Voice 1
pt_br: Voz 1
sr: Глас 1

source: Voice %u
pt_br: Voz %u
sr: Глас %u

source: Machine
pt_br: Máquina
sr: Машина

source: Pattern
pt_br: Padrão
sr: Шаблон

source: Wave
pt_br: Onda
sr: Талас

source: Octave
pt_br: Oitava
sr: Октава

source: Play live
pt_br: Reproduzir ao vivo
sr: Пусти уживо

source: Play notes and triggers while editing the pattern
pt_br: Reproduz notas e disparadores enquanto edita o padrão
sr: Пусти ноте и окидаче приликом обраде шаблона

source: Pattern view menu
pt_br: Menu de visão de padrão
sr: Изборник прегледа шаблона

source: Menu actions for pattern view below
pt_br: Ações de menu para a visão de padrão abaixo
sr: Радње изборника за преглед шаблона испод

source: New voice
pt_br: Nova voz
sr: Нови глас

source: Remove last voice
pt_br: Remover a última voz
sr: Уклони последњи глас

source: New pattern …
pt_br: Novo padrão…
sr: Нови шаблон …

source: Pattern properties…
pt_br: Propriedades do padrão…
sr: Својства шаблона…

source: Remove pattern…
pt_br: Remover padrão…
sr: Уклони шаблон…

source: Copy pattern…
pt_br: Copiar padrão…
sr: Умножи шаблон…

source: Machine properties
pt_br: Propriedades da máquina
sr: Својства машине

source: Machine preferences
pt_br: Preferências da máquina
sr: Поставке машине

source: Pos.
sr: Пол.

source: Ticks
pt_br: Tiques
sr: Врхови

source: Time
pt_br: Tempo
sr: Време

source: Beats
pt_br: Batidas
sr: Тактови

source: Labels
pt_br: Etiquetas
sr: Натписи

source: Show every n-th line
pt_br: Mostra a cada n-ésima linha
sr: Прикажи сваки n-ти ред

source: Steps
pt_br: Passos
sr: Кораци

source: Follow playback
pt_br: Seguir a reprodução
sr: Прати репродукцију

source: Sequence view menu
pt_br: Menu de visão de sequência
sr: Изборник прегледа низа

source: Menu actions for sequence view below
pt_br: Ações de menu para a visão de sequência abaixo
sr: Радње изборника за преглед низа испод

source: Add track
pt_br: Adicionar faixa
sr: Додај нумеру

source: Remove track
pt_br: Remover faixa
sr: Уклони нумеру

source: Move track left
pt_br: Mover faixa para esquerda
sr: Премести нумеру на лево

source: Move track right
pt_br: Mover faixa para direita
sr: Премести нумеру на десно

source: Browse to labels in the sequence
pt_br: Navegar para etiquetas na sequência
sr: Разгледај до натписа у низу

source: Key
pt_br: Chave
sr: Кључ

source: Patterns
pt_br: Padrões
sr: Шаблони

source: Add new tracks from right click context menu.
pt_br: Adicione novas faixas a partir do menu de contexto (com botão direito do mouse).
sr: Додајте нове нумере из приручног изборника десног клика.

source: Play current wave table entry as C-4
pt_br: Reproduz a entrada atual da tabela de ondas como C-4
sr: Свирај текући унос таласне табеле као „C-4“

source: Stop playback of current wave table entry
pt_br: Interrompe a reprodução da entrada atual da tabela de ondas
sr: Заустави репродукцију текућег уноса таласне табеле

source: _Clear
pt_br: _Limpar
sr: _Очисти

source: Clear current wave table entry
pt_br: Limpa a entrada atual da tabela de ondas
sr: Очисти текући унос таласне табеле

source: Volume
sr: Јачина звука

source: Loop
pt_br: Repetição
sr: Петља

source: Play current sample
pt_br: Reproduz a amostra atual
sr: Пусти текући узорак

source: Load current sample into selected wave table entry
pt_br: Carrega amostra atual na entrada selecionada da tabela de ondas
sr: Учатај текући узорак у изабрани унос таласне табеле

source: Root
pt_br: Raiz
sr: Корен

source: Length
pt_br: Tamanho
sr: Трајање

source: Rate
pt_br: Taxa
sr: Проток

source: Loop start
pt_br: Início da repetição
sr: Почетак петље

source: Loop end
pt_br: Fim da repetição
sr: Крај петље

source: machines
pt_br: máquinas
sr: машине

source: machines used in the song and their wires
pt_br: máquinas usadas na música e suas linhas
sr: машине коришћене у песми и њиховим жицама

source: patterns
pt_br: padrões
sr: шаблони

source: event pattern editor
pt_br: editor de padrão de eventos
sr: уређивач шаблона догађаја

source: sequence
pt_br: sequência
sr: низ

source: song sequence editor
pt_br: editor de sequência de música
sr: уређивач низа песме

source: wave table
pt_br: tabela de ondas
sr: таласна табела

source: sample wave table editor
pt_br: editor de amostra da tabela de ondas
sr: уређивач узорка таласне табеле

source: information
pt_br: informação
sr: подаци

source: song meta data editor
pt_br: editor de metadados de música
sr: уређивач метаподатака песме

source: CPU load
pt_br: Carga de CPU
sr: Учитавање процесора

source: Playback time
pt_br: Tempo da reprodução
sr: Време репродукције

source: Playback position
pt_br: Posição da reprodução
sr: Положај репродукције

source: Playback length
pt_br: Tamanho da reprodução
sr: Трајање репродукције

source: Error
pt_br: Erro
sr: Грешка

source: Warning
pt_br: Alerta
sr: Упозорење

source: Prepare a new empty song
pt_br: Prepara uma nova música vazia
sr: Примпреми нову празну песму

source: Load a new song
pt_br: Carrega uma nova música
sr: Учитај нову песму

source: Save this song
pt_br: Salva esta música
sr: Сачувај ову песму

source: R_ewind
pt_br: _Voltar
sr: На_зад

source: Rewind playback position of this song
pt_br: Volta a posição de reprodução desta música
sr: Померите уназад положај репродукције ове песме

source: Play this song
pt_br: Reproduz esta música
sr: Пусти ову песму

source: _Forward
pt_br: _Avançar
sr: На_пред

source: Forward playback position of this song
pt_br: Avança a posição de reprodução desta música
sr: Померите унапред положај репродукције ове песме

source: Stop playback of this song
pt_br: Interrompe a reprodução desta música
sr: Заустави репродукцију ове песме

source: Toggle looping of playback
pt_br: Ativa repetição de reprodução
sr: Пребаци понављање репродукције

source: playback volume
pt_br: volume de reprodução
sr: јачина звука репродукције

source: Change playback volume
pt_br: Altera o volume de reprodução
sr: Промени јачину звука репродукције

source: unsaved
pt_br: não salva
sr: несачувано

source: saved
pt_br: salva
sr: сачувано

source: %d %s and %d %s
pt_br: %d %s e %d %s
sr: %d %s и %d %s

source: hour
pt_br: hora
sr: сат
