Repository: Buzztrax/buzztrax
Catalog: po/*.po
Languages: pt_br, sr

source: hours
pt_br: horas
sr: сата

source: minute
pt_br: minuto
sr: минут

source: minutes
pt_br: minutos
sr: минута

source: second
pt_br: segundo
sr: секунда

source: seconds
pt_br: segundos
sr: секунде

source: All unsaved changes since %s will be lost. This song was last saved on: %s
pt_br: Todas alterações não salvas desde %s serão perdidas. Esta música foi salva pela última vez em: %s
sr: Све несачуване измене до „%s“ биће изгубљене. Ова песма је сачувана последњи пут: %s

source: All unsaved changes since %s will be lost. This song was created on: %s
pt_br: Todas alterações não salvas desde %s serão perdidas. Esta música foi criada em: %s
sr: Све несачуване измене до „%s“ биће изгубљене. Ова песма је направљена: %s

source: Really quit?
pt_br: Realmente sair?
sr: Стварно да изађем?

source: New song?
pt_br: Nova música?
sr: Нова песма?

source: Open a song
pt_br: Abrir uma música
sr: Отворите песму

source: Can't save song '%s'.
pt_br: Não foi possível salvar a música "%s".
sr: Не могу да сачувам песму „%s“.

source: Can't save song
pt_br: Não foi possível salvar a música
sr: Не могу да сачувам песму

source: Save a song
pt_br: Salvar uma música
sr: Сачувајте песму

source: Format
pt_br: Formato
sr: Формат

source: File already exists
pt_br: O arquivo já existe
sr: Датотека већ постоји

source: Choose 'Okay' to overwrite or 'Cancel' to abort saving the song.
pt_br: Escolha "OK" para sobrescrever ou "Cancelar" para abortar o salvamento da música.
sr: Изаберите „У реду“ да препишете или „Откажи“ да прекинете чување песме.

source: An error occurred while writing the file '%s': %s
pt_br: Um erro ocorreu enquanto escrevia o arquivo "%s": %s
sr: Дошло је до грешке при записивању датотеке „%s“: %s

source: Missing GStreamer elements
pt_br: Faltando elementos do GStreamer
sr: Недостаје елемент Гстримера

source: The elements listed below are missing from your installation, but are required.
pt_br: Os elementos listados abaixo estão faltando em sua instalação, mas são necessários.
sr: Елементи на списку испод недостају у вашој инсталацији, а потребни су.

source: The elements listed below are missing from your installation, but are recommended for full functionality.
pt_br: Os elementos listados abaixo estão faltando em sua instalação, mas são recomendados para completa funcionalidade.
sr: Елементи на списку испод недостају у вашој инсталацији, али су препоручљиви за потпуну функционалност.

source: don't warn again
pt_br: não avisar novamente
sr: не упозоравај ме више

source: Missing elements in song
pt_br: Faltando elementos na música
sr: Недостају елементи у песми

source: The machines listed below are missing or failed to load.
pt_br: As máquinas listadas abaixo estão faltando ou falharam ao carregar.
sr: Машине на списку испод недостају или нису успеле да се учитају.

source: The waves listed below are missing or failed to load.
pt_br: As ondas listadas abaixo estão faltando ou falharam ao carregar.
sr: Таласи на списку испод недостају или нису успели да се учитају.

source: length
pt_br: tamanho
sr: тарјање

source: voices
pt_br: vozes
sr: гласови

source: Recording to: %s
pt_br: Gravando para: %s
sr: Снимам у: %s

source: File already exists! It will be overwritten if you continue.
pt_br: O arquivo "%s" já existe! Ele será sobrescrito se você continuar.
sr: Датотека већ постоји! Биже преписана ако наставите.

source: song rendering
pt_br: renderização de música
sr: исцртавање песме

source: OK
sr: У реду

source: Folder
pt_br: Pasta
sr: Фасцикла

source: Select a folder
pt_br: Selecione uma pasta
sr: Изаберите фасциклу

source: Filename
pt_br: Nome do arquivo
sr: Назив датотеке

source: Mode
pt_br: Modo
sr: Режим

source: buzztrax settings
pt_br: Configurações do buzztrax
sr: Подешавања зујавка

source: Audio Devices
pt_br: Dispositivos de áudio
sr: Звучни уређаји

source: Directories
pt_br: Diretórios
sr: Директоријуми

source: Interaction Controller
pt_br: Controlador de interação
sr: Контролер интеракције

source: Playback Controller
pt_br: Controlador de reprodução
sr: Контролер репродукције

source: Shortcuts
pt_br: Atalhos
sr: Пречице

source: User interface
pt_br: Interface de usuário
sr: Корисничко сучеље

source: User Interface
pt_br: Interface de usuário
sr: Корисничко сучеље

source: Auto
sr: Ауто

source: Audio Device
pt_br: Dispositivo de áudio
sr: Звучни уређај

source: Sink
pt_br: Destino
sr: Усклађеност

source: system default: %s (%s)
pt_br: padrão do sistema: %s (%s)
sr: системске основности: %s (%s)

source: system default: -
pt_br: padrão do sistema: -
sr: системске основности: -

source: Audio device
pt_br: Dispositivo de áudio
sr: Звучни уређај

source: Sampling rate
pt_br: Taxa de amostragem
sr: Проток узорковања

source: Channels
pt_br: Canais
sr: Канали

source: mono
sr: моно

source: stereo
pt_br: estéreo
sr: стерео

source: Latency
pt_br: Latência
sr: Кашњење

source: Songs
pt_br: Músicas
sr: Песме

source: Recordings
pt_br: Gravações
sr: Снимања

source: Waveforms
pt_br: Formas de onda
sr: Таласни облици

source: Plug a USB input device or midi controller
pt_br: Conecte um dispositivo USB de entrada ou controlador de midi
sr: Прикључите улазни УСБ уређај или миди контролер

source: Use the device's controls to train them.
pt_br: Use os controles do dispositivo para treiná-los.
sr: Користите контроле уређаја да их вучете.

source: Device
pt_br: Dispositivo
sr: Уређај

source: In use
pt_br: Em uso
sr: У употреби

source: Controller
pt_br: Controlador
sr: Контролер

source: This package has been built without GUdev and Alsa support and thus supports no interaction controllers.
pt_br: Este pacote foi compilado sem suporte a GUdev e Alsa e, portanto, não oferece suporte a controladores de interação.
sr: Овај пакет је изграђен без подршке ГУдев-а и Алсе а такве подршке не дејствују на контролере.

source: Master
pt_br: Mestre
sr: Главни

source: Slave
pt_br: Escravo
sr: Споредни

source: Port number
pt_br: Número da porta
sr: Број прикључника

source: Requires Coherence UPnP framework which can be found at: https://coherence.beebits.net.
pt_br: Requer o framework UPnP Coherence, o qual pode ser encontrado em: https://coherence.beebits.net.
sr: Захтева Кохерентни УПнП радни оквир који можете наћи на: https://coherence.beebits.net.

source: Jack transport requires that the jackaudiosink is active. Your current audiosink is '%s'.
pt_br: O transporte Jack necessita que o jackaudiosink esteja ativo. Seu audiosink atual é "%s".
sr: Џек пренос захтева да је активан „jackaudiosink“. Ваш тренутни усаглашавач звука је „%s“.

source: none
pt_br: nenhum
sr: ништа

source: Play
pt_br: Reproduzir
sr: Пусти

source: Stop
pt_br: Interromper
sr: Заустави

source: Rewind
pt_br: Voltar
sr: Назад

source: Forward
pt_br: Avançar
sr: Напред

source: Dark theme variant
pt_br: Variante de tema escuro
sr: Тамна варијанта теме

source: Compact theme variant
pt_br: Variante de tema compacto
sr: Компактна варијанта теме

source: %s analysis
pt_br: análise de %s
sr: Анализа „%s“

source: frequency mapping
pt_br: mapeamento de frequência
sr: мапирање учесталости

source: lin.
sr: лин.

source: log.
sr: лог.

source: spectrum precision
pt_br: precisão de espectro
sr: прецизност спектра

source: single
pt_br: singular
sr: једно

source: double
pt_br: duplo
sr: два

source: triple
pt_br: triplo
sr: три

source: New machines are added in machine view from the context menu.
pt_br: Novas máquinas foram adicionadas à visão de máquina do menu de contexto.
sr: Нове машине су додате у преглед машина из приручног изборника.

source: Connect machines by holding the shift key and dragging a connection for the source to the target machine.
pt_br: Conecte máquinas segurando a tecla Shift e arrastando uma conexão da máquina de origem até a de destino.
sr: Повежите машине држећи тастер „Помак“ и превуците везу за извор до циљне машине.

source: Songs can be recorded as single waves per track to give it to remixers.
pt_br: Músicas podem ser gravadas como ondas singulares por faixa, para fornecê-las a remixadores.
sr: Песме се могу снимити као појединачни таласи по нумери да би се дале ремикерсима.

source: Fill the details on the info page. When recording songs, the metadata is added to the recording as tags.
pt_br: Preencha os detalhadas na página de informação. Ao gravar músicas, os metadados são adicionados às gravações como etiquetas.
sr: Попуните детаље на страници података. Када снимате песме, метаподаци се додају снимању као ознаке.

source: Use jackaudio sink in audio device settings to get lower latencies for live machine control.
pt_br: Usa acento jackaudio em configurações de dispositivos de áudio para obter latências menores em controle de máquina em tempo real.
sr: Користите „“ усаглашавање у подешавањима звучног уређаја да снизите притајеност за управљање машине уживо.

source: You can use input devices such as joysticks, beside midi devices to live control machine parameters.
pt_br: Você pode usar dispositivos de entrada, tais como joysticks, além de dispositivos midi para parâmetros de controle de máquina em tempo real.
sr: Можете користити улазне уређаје као што су играчке палице, уз миди уређаје да уживо управљате параметрима машине.

source: You can use a upnp media client (e.g. media streamer on nokia tablets) to remote control buzztrax.
pt_br: Você pode usar um cliente de mídia upnp (ex.: streamer de média em tablets nokia) para controlar remotamente o buzztrax.
sr: Можете користити упнп медијски клијент (на пример медијски токовник на нокиа таблицама) да на даљину управљате зујавком.

source: To enter notes, imagine your pc keyboard as a music keyboard in two rows. Bottom left y/z key becomes a 'c', s a 'c#', x a 'd' and so on.
pt_br: Para inserir notas, imagine o teclado do seu PC como um teclado de música com duas linhas. As teclas y/z, na parte inferior esquerda, se torna "c", s m "c#", x um "d" e assim por diante.
sr: Да бисте унели ноте, замислите тастатури вашег рачунара као музичку клавијатуру у два реда. Доле лево тастер „y/z“ постаје „c“, „s“ → „c#“, „x“ → „d“ и тако даље.

source: You can get more help from the community on irc://irc.freenode.net/#buzztrax.
pt_br: Você pode obter mais ajuda da comunidade em irc://irc.freenode.net/#buzztrax.
sr: Можете добити још помоћи од заједнице на „irc://irc.freenode.net/#buzztrax“.

source: Pattern layouts are individual for each machine. Look at the statusbar at the bottom for information about the cursor-column.
pt_br: Layouts de padrão são individuais para cada máquina. Veja na barra de status na parte inferior da informação sobre a coluna de cursor.
sr: Распореди шаблона су појединачни за сваку машину. Погледајте на траку стања при дну за информације о колони курзора.

source: Click the speaker icon in the pattern-view to hear notes as you enter them.
pt_br: Clique no ícone de alto-falante na visão de padrão para ouvir notas na medida em que você as insere.
sr: Кликните на иконицу звучника у прегледу шаблона да чујете ноте како их будете уносили.

source: Each wire has volume and possible panorama/balance controls. These can also be adjusted in the machine-window of the machine that has the wire as an input.
pt_br: Cada linha possui volume e controles de panorama/balanço possível. Elas também podem ser ajustada na janela de máquina da máquina que possui a linha como uma entrada.
sr: Свака жица има јачину звука и могуће контроле панораме/равнотеже. Могу се такође подесити у прозору машине која има жицу као улаз.

source: The wire volume control pops up upon a click on the arrow box on the wire.
pt_br: O controle de volume da linha exibe janelas instantâneas ao clicar na caixa de seta na linha.
sr: Управљање јачином звука жице се појављује на клик над кутијом стрелице на жици.

source: The wire panorama/balance control pops up upon a shift+click on the arrow box on the wire if available.
pt_br: O controle de panorama/balanço da linha exibe exibe uma janela ao realizar a combinação de shift+clique na caixa de seta na linha se disponível.
sr: Управљање панорамом/равнотежом жице се појављује на помак+клик над кутијом стрелице на жици ако је доступно.

source: One can copy settings from the machine window (from the context menu of a group) and paste them to patterns and the other way around.
pt_br: É possível copiar configurações da janela de máquina (a partir do menu de contexto de um grupo) e colá-los em padrões, e vice-versa.
sr: Можете умножити подешавања из прозора машине (из приручног изборника групе) и убацити их у обрасце и обрнуто.

source: Install extra machines from http://github.com/Buzztrax/buzzmachines.
pt_br: Instale máquinas extras do http://github.com/Buzztrax/buzzmachines.
sr: Инсталирајте додатне машине са „http://github.com/Buzztrax/buzzmachines“.

source: Machines can also be renamed in the headers of the sequence view.
pt_br: Máquinas também podem ser renomeadas nos cabeçalhos da visão de sequência.
sr: Машине могу такође бити преименоване у заглављима прегледа секвенце.

source: Press the ',' (comma) key in the pattern editor to insert the current value for this parameter.
pt_br: Pressione a tecla "," (vírgula) no editor de padrão para inserir o valor atual para este parâmetro.
sr: Притисните тастер зареза (,) у уређивачу шаблона да уметнете текућу вредност за овај параметар.

source: Show tips on startup
pt_br: Mostrar dicas ao inicializar
sr: Прикажи савете при покретању

source: Refresh
pt_br: Outra dica
sr: Освежи

source: Disconnect
pt_br: Desconectar
sr: Прекини везу
